In [1]:
from pandas import Series, DataFrame

In [2]:
data1 = {'name':['홍길동','이순신','강감찬'], 'addr':['인천','서울','경기'],
        'age':[21,28, 33]}
data1

{'name': ['홍길동', '이순신', '강감찬'],
 'addr': ['인천', '서울', '경기'],
 'age': [21, 28, 33]}

In [3]:
df = DataFrame(data1)
df

  name addr  age
0  홍길동   인천   21
1  이순신   서울   28
2  강감찬   경기   33

In [4]:
df2 = DataFrame(data1, columns=['name','addr','age'], index = ['no.1','no.2','no.3'])
df2

     name addr  age
no.1  홍길동   인천   21
no.2  이순신   서울   28
no.3  강감찬   경기   33

In [6]:
df2.columns

Index(['name', 'addr', 'age'], dtype='object')

In [7]:
df2.index

Index(['no.1', 'no.2', 'no.3'], dtype='object')

In [8]:
# 데이터프레임의 행에 접근
# loc[] : key를 기준으로 행을 추출
# iloc[] : index를 기준으로 행을 추출
df2.loc['no.2']

name    이순신
addr     서울
age      28
Name: no.2, dtype: object

In [10]:
df2.loc[['no.2','no.3']]

     name addr  age
no.2  이순신   서울   28
no.3  강감찬   경기   33

In [11]:
df2.loc['no.1':'no.3']

     name addr  age
no.1  홍길동   인천   21
no.2  이순신   서울   28
no.3  강감찬   경기   33

In [12]:
df2.iloc[1]

name    이순신
addr     서울
age      28
Name: no.2, dtype: object

In [13]:
df2.iloc[[0,2]]

     name addr  age
no.1  홍길동   인천   21
no.3  강감찬   경기   33

In [14]:
df2.iloc[0:2]  # index 2는 포함 안됨

     name addr  age
no.1  홍길동   인천   21
no.2  이순신   서울   28

In [15]:
# 특정 데이터 추출
df2.addr['no.1']

'인천'

In [18]:
df2['name']['no.1']

'홍길동'

In [19]:
# 특정 행과 열만 추출
df2.loc[['no.1','no.3'],['name','age']]

     name  age
no.1  홍길동   21
no.3  강감찬   33

In [21]:
df2.iloc[[0,2],[0,1]]

     name addr
no.1  홍길동   인천
no.3  강감찬   경기

In [24]:
# 정렬
# df2.sort_index()   # 기본값 : ascending=1 -> 오름차순
df2.sort_index(ascending=0)

     name addr  age
no.3  강감찬   경기   33
no.2  이순신   서울   28
no.1  홍길동   인천   21

In [26]:
df2.sort_values(by='age', ascending=0)

     name addr  age
no.3  강감찬   경기   33
no.2  이순신   서울   28
no.1  홍길동   인천   21

In [28]:
# 중첩 딕셔너리를 이용한 데이터프레임생성
df3 = DataFrame({'이길동':{'지역':'서울','age':24},
                 '김길동':{'지역':'인천', 'age':26},
                 '최길동':{'지역':'인천', 'age':26}})
df3

    이길동 김길동 최길동
지역   서울  인천  인천
age  24  26  26

In [29]:
# 행 <-> 열 변환
df3.T

     지역 age
이길동  서울  24
김길동  인천  26
최길동  인천  26

In [31]:
# 열 추가
# 컬럼명이 없을때는 추가
df2['gender']=['male','female','male']
df2

     name addr  age  gender
no.1  홍길동   인천   21    male
no.2  이순신   서울   28  female
no.3  강감찬   경기   33    male

In [33]:
# 컬럼명이 있을때는 수정
df2['addr']=['충청','경상','전라']
df2

     name addr  age  gender
no.1  홍길동   충청   21    male
no.2  이순신   경상   28  female
no.3  강감찬   전라   33    male

In [35]:
df2['age'] = 25
df2

     name addr  age  gender
no.1  홍길동   충청   25    male
no.2  이순신   경상   25  female
no.3  강감찬   전라   25    male

In [36]:
df2['name']['no.2']='임꺽정'
df2

<ipython-input-36-1cabb078e62a>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['name']['no.2']='임꺽정'

     name addr  age  gender
no.1  홍길동   충청   25    male
no.2  임꺽정   경상   25  female
no.3  강감찬   전라   25    male

In [37]:
df2.name['no.2'] = '장보고'
df2

<ipython-input-37-98dda198e813>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.name['no.2'] = '장보고'

     name addr  age  gender
no.1  홍길동   충청   25    male
no.2  장보고   경상   25  female
no.3  강감찬   전라   25    male

In [38]:
# 행삽입
df2.loc['no.4']=['을지문덕','제주',35,'female']
df2

      name addr  age  gender
no.1   홍길동   충청   25    male
no.2   장보고   경상   25  female
no.3   강감찬   전라   25    male
no.4  을지문덕   제주   35  female

In [46]:
# 행삭제
# del : 원본파일이 삭제
# drop : 원본파일은 삭제 안됨
df4 = df2.drop(['no.2'])
df4

      name addr  age
no.1   홍길동   충청   25
no.3   강감찬   전라   25
no.4  을지문덕   제주   35

In [57]:
# 열삭제
# df5 = df2.drop(['age'], axis=1)
df5 = DataFrame(data1, columns=['name','addr','age'], index = ['no.1','no.2','no.3'])
del df5['age']
df5

     name addr
no.1  홍길동   인천
no.2  이순신   서울
no.3  강감찬   경기

In [59]:
df6 = DataFrame(data1, columns=['name','addr','age'],
                index = ['no.1','no.2','no.3'])
df6

     name addr  age
no.1  홍길동   인천   21
no.2  이순신   서울   28
no.3  강감찬   경기   33

In [60]:
df7 = DataFrame({'addr':['충청','인천','제주'],
                'tel':['041','032','001'],
                'department':['컴퓨터공학과','통계학과','디자인학과']})
df7

  addr  tel department
0   충청  041     컴퓨터공학과
1   인천  032       통계학과
2   제주  001      디자인학과

In [61]:
import pandas as pd
result = pd.merge(df6,df7,on='addr') # inner join과 같음. 겹치는 것만 병합
result

  name addr  age  tel department
0  홍길동   인천   21  032       통계학과

In [62]:
result2 = pd.merge(df6,df7,how='left')
result2

  name addr  age  tel department
0  홍길동   인천   21  032       통계학과
1  이순신   서울   28  NaN        NaN
2  강감찬   경기   33  NaN        NaN

In [63]:
result3 = pd.merge(df6,df7,how='right')
result3

  name addr   age  tel department
0  NaN   충청   NaN  041     컴퓨터공학과
1  홍길동   인천  21.0  032       통계학과
2  NaN   제주   NaN  001      디자인학과

In [64]:
result4 = pd.merge(df6,df7,how='outer')
result4

  name addr   age  tel department
0  홍길동   인천  21.0  032       통계학과
1  이순신   서울  28.0  NaN        NaN
2  강감찬   경기  33.0  NaN        NaN
3  NaN   충청   NaN  041     컴퓨터공학과
4  NaN   제주   NaN  001      디자인학과

In [65]:
# 데이터프레임 연결
result5 = pd.concat([df6,df7])
result5

     name addr   age  tel department
no.1  홍길동   인천  21.0  NaN        NaN
no.2  이순신   서울  28.0  NaN        NaN
no.3  강감찬   경기  33.0  NaN        NaN
0     NaN   충청   NaN  041     컴퓨터공학과
1     NaN   인천   NaN  032       통계학과
2     NaN   제주   NaN  001      디자인학과

### 학생정보
      학번   이름   학과
 no1<br>
 no2<br>
 no3<br><br>
 
 원하는 데이터 추출<br>
 수정<br>
 행삽입<br>
 열삽입<br>
 병합 : DataFrame을 하나더 만들어서(학과,수강과목,나이)사용 key:학과